; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v10 ?v5)
             (pred_1 ?v3 ?v6)
             (pred_6 ?v10 ?v6)
             (pred_2 ?v9 ?v10 )
	     (pred_12 ?v10)
             (pred_11 ?v2)
             (pred_5 ?v3)
             (pred_4 ?v6)
             (pred_3 ?v10)
             (pred_9 ?v3)
             (pred_8 ?v10)
             (pred_7 ))



(:action op_1
:parameters (?v4 ?v12 ?v11 ?v13)
:precondition (and (pred_11 ?v4) (pred_11 ?v12) (pred_5 ?v11) (pred_4 ?v13)
          (pred_10 ?v4 ?v12) (pred_1 ?v11 ?v13)
                   (pred_6 ?v12 ?v13) (pred_12 ?v4) 
                   (pred_3 ?v12) (pred_9 ?v11))
:effect (and  (pred_8 ?v12) (not (pred_3 ?v12))))


(:action op_5
:parameters (?v4 ?v7)
:precondition (and (pred_11 ?v4) (pred_11 ?v7)
               (pred_12 ?v4) (pred_10 ?v4 ?v7) (pred_8 ?v7))
:effect (and (pred_12 ?v7) (not (pred_12 ?v4))))

(:action op_4
:parameters (?v4 ?v11)
:precondition (and (pred_11 ?v4) (pred_5 ?v11) 
                  (pred_12 ?v4) (pred_2 ?v11 ?v4) (pred_7 ))
:effect (and (pred_9 ?v11)
   (not (pred_2 ?v11 ?v4)) (not (pred_7 ))))


(:action op_3
:parameters (?v4 ?v1 ?v8)
:precondition (and (pred_11 ?v4) (pred_5 ?v1) (pred_5 ?v8)
                  (pred_12 ?v4) (pred_9 ?v8) (pred_2 ?v1 ?v4))
:effect (and (pred_9 ?v1) (pred_2 ?v8 ?v4)
        (not (pred_9 ?v8)) (not (pred_2 ?v1 ?v4))))

(:action op_2
:parameters (?v4 ?v11)
:precondition (and (pred_11 ?v4) (pred_5 ?v11) 
                  (pred_12 ?v4) (pred_9 ?v11))
:effect (and (pred_7 ) (pred_2 ?v11 ?v4) (not (pred_9 ?v11)))))

; problem
(define (problem grid-4-4-2-2-2)
    (:domain grid)
    (:objects
    obj_17 obj_20 obj_08 obj_09 obj_18 obj_11 obj_02 obj_12 obj_16 obj_01 obj_15 obj_03 obj_14 obj_10 obj_06 obj_19
    obj_07 obj_04
    obj_05 obj_13
    )

    (:init
       (pred_7)

       (pred_11 obj_17)
       (pred_11 obj_20)
       (pred_11 obj_08)
       (pred_11 obj_09)
       (pred_11 obj_18)
       (pred_11 obj_11)
       (pred_11 obj_02)
       (pred_11 obj_12)
       (pred_11 obj_16)
       (pred_11 obj_01)
       (pred_11 obj_15)
       (pred_11 obj_03)
       (pred_11 obj_14)
       (pred_11 obj_10)
       (pred_11 obj_06)
       (pred_11 obj_19)
       (pred_4 obj_07)
       (pred_4 obj_04)
       (pred_5 obj_05)
       (pred_5 obj_13)

       (pred_10 obj_17 obj_18)
       (pred_10 obj_17 obj_20)
       (pred_10 obj_20 obj_11)
       (pred_10 obj_20 obj_08)
       (pred_10 obj_20 obj_17)
       (pred_10 obj_08 obj_02)
       (pred_10 obj_08 obj_09)
       (pred_10 obj_08 obj_20)
       (pred_10 obj_09 obj_12)
       (pred_10 obj_09 obj_08)
       (pred_10 obj_18 obj_16)
       (pred_10 obj_18 obj_11)
       (pred_10 obj_18 obj_17)
       (pred_10 obj_11 obj_01)
       (pred_10 obj_11 obj_02)
       (pred_10 obj_11 obj_20)
       (pred_10 obj_11 obj_18)
       (pred_10 obj_02 obj_15)
       (pred_10 obj_02 obj_12)
       (pred_10 obj_02 obj_08)
       (pred_10 obj_02 obj_11)
       (pred_10 obj_12 obj_03)
       (pred_10 obj_12 obj_09)
       (pred_10 obj_12 obj_02)
       (pred_10 obj_16 obj_14)
       (pred_10 obj_16 obj_01)
       (pred_10 obj_16 obj_18)
       (pred_10 obj_01 obj_10)
       (pred_10 obj_01 obj_15)
       (pred_10 obj_01 obj_11)
       (pred_10 obj_01 obj_16)
       (pred_10 obj_15 obj_06)
       (pred_10 obj_15 obj_03)
       (pred_10 obj_15 obj_02)
       (pred_10 obj_15 obj_01)
       (pred_10 obj_03 obj_19)
       (pred_10 obj_03 obj_12)
       (pred_10 obj_03 obj_15)
       (pred_10 obj_14 obj_10)
       (pred_10 obj_14 obj_16)
       (pred_10 obj_10 obj_06)
       (pred_10 obj_10 obj_01)
       (pred_10 obj_10 obj_14)
       (pred_10 obj_06 obj_19)
       (pred_10 obj_06 obj_15)
       (pred_10 obj_06 obj_10)
       (pred_10 obj_19 obj_03)
       (pred_10 obj_19 obj_06)
       (pred_3 obj_11)
       (pred_3 obj_12)
       (pred_6  obj_11 obj_07)
       (pred_6  obj_12 obj_04)
       (pred_8 obj_17)
       (pred_8 obj_20)
       (pred_8 obj_08)
       (pred_8 obj_09)
       (pred_8 obj_18)
       (pred_8 obj_02)
       (pred_8 obj_16)
       (pred_8 obj_01)
       (pred_8 obj_15)
       (pred_8 obj_03)
       (pred_8 obj_14)
       (pred_8 obj_10)
       (pred_8 obj_06)
       (pred_8 obj_19)

       (pred_1  obj_05 obj_07)
       (pred_1  obj_13 obj_04)
       (pred_2 obj_05 obj_16)
       (pred_2 obj_13 obj_06)
       (pred_12 obj_18)
    )

    (:goal (and
       (pred_2 obj_13 obj_19)
    ))
(:constraints
  (always (not (pred_12 obj_15)))
)
)

; plan
1. (op_5 obj_18 obj_16)
   deleted: (pred_12 obj_18)
   added: (pred_12 obj_16)
   goals met: 0 of 1
2. (op_5 obj_16 obj_14)
   deleted: (pred_12 obj_16)
   added: (pred_12 obj_14)
   goals met: 0 of 1
3. (op_5 obj_14 obj_10)
   deleted: (pred_12 obj_14)
   added: (pred_12 obj_10)
   goals met: 0 of 1
4. (op_5 obj_10 obj_06)
   deleted: (pred_12 obj_10)
   added: (pred_12 obj_06)
   goals met: 0 of 1
5. (op_4 obj_06 obj_13)
   deleted: (pred_2 obj_13 obj_06) (pred_7)
   added: (pred_9 obj_13)
   goals met: 0 of 1
6. (op_5 obj_06 obj_19)
   deleted: (pred_12 obj_06)
   added: (pred_12 obj_19)
   goals met: 0 of 1
7. (op_2 obj_19 obj_13)
   deleted: (pred_9 obj_13)
   added: (pred_7) (pred_2 obj_13 obj_19)
   goals met: 1 of 1
